#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/randovania/server/runs/run-vWuiDxUm4sCssaJa

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
digitalocean_droplet.main: Refreshing state... [id=207924731]
digitalocean_droplet.staging: Refreshing state... [id=348891762]
digitalocean_floating_ip.randovania_metroidprime_run: Refreshing state... [id=138.68.125.26]
digitalocean_firewall.http_server: Refreshing state... [id=2fcd8b6b-b72c-4a57-9c3f-4146e270e9ee]
digitalocean_firewall.swarm_member: Refreshing state... [id=2a89bbb9-c6a4-43b9-8250-5de2f22419bb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_droplet.production will be created
  + resource "digitalocean_droplet" "production" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "docker-22-04"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "production-fra1-01"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + ssh_keys             = [
          + "37:df:56:8b:b6:e1:d8:eb:23:93:f4:14:8c:98:1c:43",
        ]
      + status               = (known after apply)
      + tags                 = [
          + "critical",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_firewall.http_server will be updated in-place
  ~ resource "digitalocean_firewall" "http_server" {
      ~ droplet_ids     = [
          - 207924731,
        ] -> (known after apply)
        id              = "2fcd8b6b-b72c-4a57-9c3f-4146e270e9ee"
        name            = "http-server"
        tags            = []
        # (3 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @henriquegemignani, Action: `pull_request`*